num1 = int(input("num1:"))
num2 = int(input("num2: "))

დამატება = (num1 + num2)
გამოკლება = (num1-num2)
გაყოფა = (num1 / num2)
გამრავლება = (num1 * num2)
სხვაობა = (num1 != num2)
ხარისხი_პირველისა_მეორეზე = (num1>num2)
ხარისხი_მეორისა_პირველზე = (num1<num2)

print("დამატება: ",დამატება)
print("გამოკლება: ",გამოკლება)
print("გაყოფა: ",გაყოფა)
print("გამრავლება: ",გამრავლება)
print("სხვაობ: ",სხვაობა)
print("ხარისხი_პირ",ხარისხი_პირველისა_მეორეზე)
print("ხარისხი_მეორისა_პირველზე",ხარისხი_მეორისა_პირველზე)

