# საკლასო დავალება:

#შექმენით ანონიმური ფუნქცია, რომელსაც გადაეცემა სთრინგი. ფუნქციამ სთრინგი უნდა დააბრუნოს შემობრუნებული და შემდეგ capitalized ფორმატში გადაყვანილი. 

#ფუნქცია გამოიძახეთ 3-ჯერ, გადაეცით განსხვავებული არგუმენტები



reverse_and_capitalize = lambda s: s[::-1].capitalize()
print(reverse_and_capitalize("python"))      
print(reverse_and_capitalize("hello world")) 
print(reverse_and_capitalize("school"))      





#შექმენით ანონიმური ფუნქცია, რომელიც უბრალოდ რიცხვს გააორმაგებს და ეგრევე გამოიძახეთ ის.

print((lambda x: x * 2)(5))
print((lambda x: x * 2)(3))  
print((lambda x: x * 2)(7))  



# საკლასო დავალება:

# შექმენით საწყისი მთელი რიცხვების სია 10 ელემენტით.

# პირდაპირ დაბეჭდეთ list ფუნქციას გადაცემული map-ის ობიექტი და მაპმა რა უნდა გააკეთოს: საწყისი სიის თითოეული ელემენტი ააკვადრატოს

list1 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
print(list(map(lambda x: x ** 2, list1)))


    
    

